/* Error string for OTR message string */
"A private conversation could not be set up." = "Percakapan pribadi belum diatur";

/* Title for the about page */
"About" = "Tentang";

/* Label for button to show version numbers and licenses */
"About This Version" = "Tentang Versi Ini";

/* SSL error message */
"Access denied" = "Akses ditolak";

/* The string describing a buddy's account */
"Account" = "Akun";

/* Title for the accounts tab */
"Accounts" = "Akun";

/* Button title to add someone as a buddy */
"Add" = "Tambah";

/* The title for the view to add a buddy */
"Add Buddy" = "Tambah Teman";

/* Label for button to create account by logging into an existing account */
"Add Existing Account" = "Add Existing Account";

/* String to describe advanced set of settings */
"Advanced" = "Advanced";

/* No comment provided by engineer. */
"Advanced Encryption Settings" = "Advanced Encryption Settings";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "Kesalahan ketika mengenkripsi pesan dan pesan tidak dapat dikirim";

/* SSL error message */
"Attempt to restore an unknown session" = "Mencoba mengembalikan sesi yang tidak diketahui";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Hapus otomatis";

/* Label in buddy list for users that are available */
"Available" = "Tersedia";

/* Label in buddy list for users that are away */
"Away" = "Pergi";

/* SSL error message */
"Bad certificate format" = "Format sertifikat buruk";

/* SSL error message */
"Bad MAC" = "MAC buruk";

/* SSL error message */
"Bad protocol version" = "versi protokol buruk";

/* SSL error message */
"Bad SSLCipherSuite" = "SSLCipherSuite buruk";

/* SSL error message */
"Bad unsupported cert format" = "Format sertifikat buruk yang tidak didukung";

/* string to describe basic set of settings */
"Basic" = "Dasar";

/* username section */
"Basic Setup" = "Basic Setup";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Karena isi dari database dienkripsi dengan kata kunci Anda, maka Anda telah kehilangan akses terhadap data Anda. Anda harus memasang ulang ChatSecure untuk melanjutkan. Password manager seperti 1Password atau MiniKeePass dapat membantu membuat dan menyimpan kata sandi yang kuat.";

/* No comment provided by engineer. */
"Best Available" = "Best Available";

/* The String for a button to block a buddy */
"Block" = "Blok";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Blok & Hilangkan";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Info Teman";

/* Cancel an alert window */
"Cancel" = "Batal";

/* Error string for OTR message string */
"Cannot read the received message." = "Tidak dapat membaca pesan yang diterima";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Tidak dapat mengidentifikasi tipe OTR yang diterima.";

/* SSL error message */
"Cert chain not verified by root" = "Rantai sertifikat tidak diverifikasi oleh root";

/* SSL error message */
"Certificate expired" = "Sertifikat kadaluarsa";

/* SSL error message */
"Certificate revoked" = "Sertifikat dicabut";

/* SSL error message */
"Chain had a cert not yet valid" = "Sertifikat Chain belum valid";

/* SSL error message */
"Chain had an expired cert" = "Sertifikat Chain kadaluarsa";

/* Title for chat view */
"Chat" = "Percakapan";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Ngobrol denganku dengan tersandi";

/* Title for chats view */
"Chats" = "Percakapan";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Periksa sumbernya di Github";

/* server selection footer */
"Choose from our list of trusted servers, or use your own." = "Choose from our list of trusted servers, or use your own.";

/* title for server selection screen */
"Choose Server" = "Choose Server";

/* SSL error message */
"Cipher Suite negotiation failure" = "Negosiasi Cipher Suite gagal";

/* Label for text field where you compose a new message */
"Compose" = "Buat Baru";

/* SSL error message */
"Configuration error" = "Kesalahan pengaturan";

/* String for button to connect connect */
"Connect" = "Connect";

/* Whether or not account is logged in */
"Connected" = "Terhubung";

/* String to state if an account is progress of creating a connection */
"Connecting" = "Menghubungi";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "Menghubungi Tor";

/* SSL error message */
"Connection closed gracefully" = "Koneksi ditutup secara anggun";

/* SSL error message */
"Connection closed via error" = "Hubungan ditutup karena kesalahan";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Salin";

/* No comment provided by engineer. */
"Could not decrypt database. If the app is not working properly, you may need to delete and reinstall." = "Could not decrypt database. If the app is not working properly, you may need to delete and reinstall.";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Tidak mendapatkan kunci publik dari sertifikat";

/* No comment provided by engineer. */
"Crash Detected" = "Crash Detected";

/* Title for button to create account */
"Create" = "Buat";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Buat akun baru";

/* Start of sentence that will be followed by names */
"Created by" = "Dibuat oleh";

/* Title for progress of creating a new account */
"Creating Account" = "Membuat akun";

/* Place holder label for custom domains */
"Custom" = "Custom";

/* if you want to change your username */
"Customize Username" = "Customize Username";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* SSL error message */
"Decoding error" = "Kesalahan ketika mendecode";

/* SSL error message */
"Decompression failure" = "Dekompresi gagal";

/* SSL error message */
"Decryption error" = "Dekripsi mengalami kesalahan";

/* SSL error message */
"Decryption failed" = "Dekripsi gagal";

/* SSL error message */
"Decryption failure" = "Dekripsi gagal";

/* default string to revert to normal language behaviour */
"Default" = "Default";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Hapus Akun?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Hapus percakapan waktu terputus";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Dikirim";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Jangan Ganggu";

/* No comment provided by engineer. */
"Don't change these unless you really know what you're doing. By default we will always select the best available encryption method." = "Don't change these unless you really know what you're doing. By default we will always select the best available encryption method.";

/* Title for donation link */
"Donate" = "Sumbang";

/* Title for button to press when user is finished */
"Done" = "Selesai";

/* The string describing account name or email address for a buddy */
"Email" = "Email";

/* enable permission */
"Enable" = "Enable";

/* button for enabling push messages */
"Enable Push" = "Enable Push";

/* button for enabling push messages in iOS system settings */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment provided by engineer. */
"Enable Tor" = "Enable Tor";

/* Generic title for encryption errors */
"Encryption Error" = "Kesalahan enkripsi";

/* The placeholder text for the text field to enter a group chat name or label */
"Enter a group name" = "Enter a group name";

/* Title of error message pop-up box */
"Error" = "Error";

/* title label for error when creating account */
"Error Creating Account" = "Kesalahan Ketika Membuat Akun";

/* SSL error message */
"Export restriction" = "Batasi ekspor";

/* Default message when a user status is set to extended away */
"Extended Away" = "Extended Away";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Gagal menghubungi XMPP server. Pastikan login anda benar dan terkoneksi dengan internet, kemudian coba lagi.";

/* SSL error message */
"Fatal alert" = "Kesalahan fatal";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Lupakan kata kunci?";

/* whether or not we should generate a strong password for them */
"Generate Secure Password" = "Generate Secure Password";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* a subtitle label for a group chat */
"Group Chat" = "Group Chat";

/* The title for the view to enter a group chat name or label */
"Group Name" = "Group Name";

/* SSL error message */
"Handshake failure" = "Jabat tangan gagal";

/* Label for button to open link to translate app */
"Help Translate" = "Bantu menerjemahkan";

/* Label for button to hold to record audio */
"Hold to talk" = "Hold to talk";

/* Label text for hostname field on login scree */
"Hostname" = "Nama Host";

/* SSL error message */
"I/O would block (not fatal)" = "I/O mungkin diblok (tidak fatal)";

/* SSL error message */
"Illegal parameter" = "Parameter ilegal";

/* Label for incoming data transfers */
"Incoming" = "Incoming";

/* Short for information, button title to get more information */
"Info" = "Info";

/* SSL error message */
"Insufficient buffer provided" = "Buffer tidak cukup";

/* SSL error message */
"Insufficient security" = "Keamanan tidak memadai";

/* SSL error message */
"Internal error" = "Kesalahan internal";

/* SSL error message */
"Invalid certificate chain" = "Rangkaian sertifikat tidak valid";

/* title label for invalid email */
"Invalid Email" = "Email salah";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Jabber (XMPP)";

/* Label for button after to send push notification knock. Like knocking on a door */
"Knock" = "Knock";

/* Text for label after knock is sent. Like knocking on a door */
"Knock Sent" = "Knock Sent";

/* string to bring up language selector */
"Language" = "Bahasa";

/* log in to account */
"Log In" = "Masuk";

/* log out from account */
"Log Out" = "Keluar";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Masuk otomatis";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "Atur akun ChatSecure Push";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Atur sertifikat SSL yang tersimpan";

/* No comment provided by engineer. */
"Me" = "Me";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Pesan tidak dapat dikirim karena teman telah mengakhiri obrolan pribadi. Sebaiknya tutup koneksi, atau merefresh kembali.";

/* microphone permission is disabled */
"Microphone Disabled" = "Microphone Disabled";

/* SSL error message */
"Miscellaneous bad certificate" = "Miscellaneous bad certificate";

/* SSL error message */
"Module attach failure" = "Gagal memasang modul";

/* Your QR code */
"My QR Code" = "My QR Code";

/* The string describing a buddy's display name */
"Name" = "Nama";

/* For a new settings value */
"New" = "Baru";

/* Title for New Account View */
"New Account" = "Akun Baru";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "Sertifikat SSL Baru";

/* Label for button to go to next step */
"Next" = "Selanjutnya";

/* for choosing your XMPP vCard display name */
"Nickname" = "Nickname";

/* SSL error message */
"No Error" = "Tidak Ada Kesalahan";

/* SSL error message */
"No renegotiation allowed" = "Negosiasi ulang tidak diizinkan";

/* Label in buddy list for users that are offline */
"Offline" = "Offline";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Lama";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Buka di Chrome";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Buka di Facebook";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Buka di Twitter";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Boleh tak diisi";

/* Title for other miscellaneous settings group */
"Other" = "Lainnya";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "Kami mensyaratkan enkripsi namun kami tetap mencoba mengirimkan pesan tanpa enkripsi";

/* Label text for password field on login screen */
"Password" = "Sandi";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "Peer cert is valid, or was ignored if verification disabled";

/* SSL error message */
"Peer dropped connection before responding" = "Peer dropped connection before responding";

/* SSL error message */
"Peer host name mismatch" = "Nama host peer tidak cocok";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Menunggu Persetujuan";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Hapus permanen";

/* Label for button to open up photo library and choose photo */
"Photo Library" = "Photo Library";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Sematkan Sertifikat";

/* Label for messages that are not encrypted */
"plaintext" = "plaintext";

/* No comment provided by engineer. */
"Plaintext (Opportunistic OTR)" = "Plaintext (Opportunistic OTR)";

/* No comment provided by engineer. */
"Plaintext Only" = "Plaintext Only";

/* detail title label for invalid email */
"Please choose a valid email address" = "Mohon masukkan alamat email yang benar";

/* Label for port number field for connecting to service */
"Port" = "Port";

/* title for contacts profile view */
"Profile" = "Profile";

/* Title for push-messaging related settings */
"Push" = "Push";

/* Label for qr code image */
"QR code" = "Kode QR";

/* Error string for OTR message string */
"Received a general OTR error." = "Received a general OTR error.";

/* Error string for OTR message string */
"Received a heartbeat." = "Received a heartbeat.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Menerima pesan terenkripsi namun tidak dapat dibuka karena koneksi pribadi belum tersambung";

/* Error string for OTR message string */
"Received an unencrypted message." = "Menerima pesan tidak dienkripsi";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Menerima dan membuang pesan yang ditujukan untuk pihak lain";

/* Error string for OTR message string */
"Received our own OTR messages." = "Received our own OTR messages.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Belakangan Ini";

/* SSL error message */
"Record overflow" = "Record overflow";

/* Button title to reject a request such as a buddy request */
"Reject" = "Tolak";

/* Label for instruction to delete current recording */
"Release to delete" = "Release to delete";

/* Label for instruction to send current audio */
"Release to send" = "Release to send";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Ingat Kata Kunci";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Ingat password";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Hilangkan";

/* No comment provided by engineer. */
"Removed By Server" = "Removed By Server";

/* Reply to an incoming message */
"Reply" = "Balas";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Diperlukan";

/* Label for button to resend message. */
"Resend" = "Resend";

/* Ttitle for alert view to resend a message */
"Resend Message" = "Resend Message";

/* Describe what resending will do the %@ will be replaced withe the method OTR/OMEMO/Plaintext */
"Resending this message will use %@." = "Resending this message will use %@.";

/* Label for text input for XMPP resource */
"Resource" = "Sumber";

/* Title for button for saving a setting */
"Save" = "Simpan";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Sertifikat Tersimpan";

/* Label for sharing via QR Code */
"Scan QR" = "Scan QR";

/* Label for text field where you search for a buddy */
"Search" = "Cari";

/* Title heading in settings */
"Security" = "Keamanan";

/* Title of alert box warning about security issues */
"Security Warning" = "Peringatan Keamanan";

/* The placeholder text in the chat view where the message should go */
"Send %@ encrypted message" = "Send %@ encrypted message";

/* String on button to email feedback */
"Send Feedback" = "Kirim Saran";

/* The placeholder text in the chat view where the message should go */
"Click here to type something..." = "Click here to type something...";

/* Label text for when a transfer is in progress (normally followed by a percent value 34%) */
"Sending" = "Sending";

/* Error string for OTR message string */
"Sent a heartbeat." = "Sent a heartbeat.";

/* server selection section title */
"Server" = "Server";

/* SSL error message */
"Server closed session with no notification" = "Server menutup sesi tanpa pemberitahuan";

/* SSL error message */
"Server has requested a client cert" = "Server has requested a client cert";

/* Title for the Settings screen */
"Settings" = "Pengaturan";

/* Title for sharing a link to the app */
"Share" = "Bagikan";

/* Label for inviting friends via URL */
"Share Invite" = "Share Invite";

/* No comment provided by engineer. */
"Show Advanced Encryption Settings" = "Show Advanced Encryption Settings";

/* toggle switch for show advanced */
"Show Advanced Options" = "Show Advanced Options";

/* title label for signing up for a new account */
"Sign Up" = "Daftar";

/* Label for button to skip this step */
"Skip" = "Lewati";

/* A placeholder for a buddy's username like Someone wants to chat. */
"Someone" = "Someone";

/* SSL error message */
"SSL protocol error" = "Kesalahan protokol SSL ";

/* Label for button to take a photo from camera */
"Take Photo" = "Take Photo";

/* No comment provided by engineer. */
"The app crashed last time it was launched. Send a crash report?" = "The app crashed last time it was launched. Send a crash report?";

/* Error string for OTR message string */
"The message received contains malformed data." = "Pesan yang diterima mengandung data yang salah";

/* Error string for OTR message string */
"The previous message was resent." = "Pesan sebelumnya dikirim ulang";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "The XMPP server does not support in-band registration";

/* basic setup selection footer */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "This device doesn't seem to be configured to make payments.";

/* Error message description */
"This message was received from an untrusted device." = "This message was received from an untrusted device.";

/* Error message description */
"This message was sent to an untrusted device." = "This message was sent to an untrusted device.";

/* microphone permission is disabled */
"To use this feature you must re-enable microphone permissions." = "To use this feature you must re-enable microphone permissions.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Tor merupakan fitur eksperimen, gunakan secara bijak";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* Title for error message */
"Unable to Send Message" = "Unable to Send Message";

/* SSL error message */
"Underlying cryptographic error" = "Underlying cryptographic error";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Unexpected (skipped) record in DTLS";

/* SSL error message */
"Unexpected message received" = "Pesan tidak terduga diterima";

/* SSL error message */
"Unknown Cert Authority" = "Otoritas sertifikat tidak diketahui";

/* SSL error message */
"Unknown certificate" = "Sertifikat tidak diketahui";

/* Describes an error without a known cause */
"Unknown Error" = "Unknown Error";

/* Label for button to unlock app */
"Unlock" = "Buka kunci";

/* shown when invite QR code doesnt work */
"Unrecognized Invite Format" = "Unrecognized Invite Format";

/* Title for error message */
"Untrusted Device" = "Untrusted Device";

/* SSL error message */
"User canceled" = "User canceled";

/* Example of a username using the words user and example */
"user@example.com" = "nama@contoh.com";

/* Label text for username field on login screen */
"Username" = "Nama pengguna";

/* SSL error message */
"Valid cert chain, untrusted root" = "Valid cert chain, untrusted root";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Sertifikat valid";

/* To let the user know the fingerprint as been checked */
"Verified" = "Terverifikasi";

/* Shown when verifying fingerprints */
"Verify" = "Verifikasi";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Verifikasi Sidik Jari";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Versi";

/* The label for a button to view the buddy profile */
"View Profile" = "View Profile";

/* Describe how to change a contact's device settings */
"View profile to review contact's devices or change encryption settings." = "View profile to review contact's devices or change encryption settings.";

/* Label text for when a transfer has not started yet */
"Waiting" = "Waiting";

/* This string follows a user's dislplay name or username ex Bob wants to chat. */
"wants to chat." = "wants to chat.";

/* help text for password generator */
"We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else." = "We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this account." = "We could not find any trusted devices for this account.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this contact." = "We could not find any trusted devices for this contact.";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Apakah Anda ingin menggunakan UserVoice untuk mengirimkan saran?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* String used when onboarding works */
"You're ready to use" = "You're ready to use";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "Donasi anda akan menolong pembiayaan pengembangan ChatSecure.";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "Sandi Anda hanya akan disimpan di iOS Keychain perangkat ini saja, yang sama keamanannya dengan kata kunci atau pin perangkat Anda. Namun, sandi akan hilang saat backup/restore via iTunes. Mohon hapalkan sandi Anda atau Anda akan kehilangan riwayat percakapan.";

